Revit 2027 API
StructuralSection.SectionNameKey Property
 A parameter in structural families which allows for family type identification. This will be used for data mapping during model exchange with another program, namely Advance Steel.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SectionNameKey { get; set; }
Public Property SectionNameKey As String
	Get
	Set
public:
property String^ SectionNameKey {
	String^ get ();
	void set (String^ value);
}
member SectionNameKey : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace